RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_pwrcu.c
/*********************************************************************************************************//**
 * @brief Configure the VREG operation mode.
 * @param Mode: VREG operation mode.
 *   This parameter can be one of the following values:
 *     @arg PWRCU_VREG_DISABLE : The VREG is disabled
 *     @arg PWRCU_VREG_ENABLE  : The VREG is enabled
 *     @arg PWRCU_VREG_BYPASS  : The VREG is bypassed
 * @retval None
 ************************************************************************************************************/
void PWRCU_VREGConfig(PWRCU_VREG_MODE_Enum Mode)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_PWRCU_VREG_MODE(Mode));

  HT_PWRCU->CR = (HT_PWRCU->CR & VREG_M_MASK) | Mode;
}
#endif

/*********************************************************************************************************//**
 * @brief Enable or Disable the external WAKEUP pin function.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void PWRCU_WakeupPinCmd(ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    Set_WUP0EN;
  }
  else
  {
    Reset_WUP0EN;
  }
}

#if (LIBCFG_PWRCU_WAKEUP_V01)
/*********************************************************************************************************//**
 * @brief Enable or Disable the external WAKEUP pin function.
 * @param Pin: specify the WAKEUP pin number.
 *   This parameter can be one of the following values:
 *     @arg PWRCU_WAKEUP_PIN_0 :
 *     @arg PWRCU_WAKEUP_PIN_1 :
 * @param Type: specify the WAKEUP pin type.
 *   This parameter can be one of the following values:
 *     @arg PWRCU_WUP_POSITIVE_EDGE :
 *     @arg PWRCU_WUP_NEGATIVE_EDGE :
 *     @arg PWRCU_WUP_HIGH_LEVEL    :
 *     @arg PWRCU_WUP_LOW_LEVEL     :
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void PWRCU_WakeupMultiPinCmd(PWRCU_WUP_Enum Pin, PWRCU_WUPTYPE_Enum Type, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_PWRCU_WAKEUPPIN(Pin));
  Assert_Param(IS_PWRCU_TRIGGERTYPE(Type));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    if (Pin == PWRCU_WAKEUP_PIN_0)
    {
      HT_PWRCU->CR = (HT_PWRCU->CR & WUP0TYPE_MASK) | (Type << 16);
      Set_WUP0EN;
    }
    else
    {
      HT_PWRCU->CR = (HT_PWRCU->CR & WUP1TYPE_MASK) | (Type << 18);
      Set_WUP1EN;
    }
  }
  else
  {
    if (Pin == PWRCU_WAKEUP_PIN_0)
      Reset_WUP0EN;
    else
      Reset_WUP1EN;
  }
}
#endif

#if defined(USE_HT32F52342_52) || defined(USE_HT32F5826)
/*********************************************************************************************************//**
 * @brief Configure HSI ready counter bit length.
 * @param BitLength: HSI ready counter bit length.
 *   This parameter can be one of following:
 *     @arg PWRCU_HSIRCBL_4 : 4 bits
 *     @arg PWRCU_HSIRCBL_5 : 5 bits
 *     @arg PWRCU_HSIRCBL_6 : 6 bits
 *     @arg PWRCU_HSIRCBL_7 : 7 bits (Default)
 * @retval None
 ************************************************************************************************************/
void PWRCU_HSIReadyCounterBitLengthConfig(PWRCU_HSIRCBL_Enum BitLength)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_PWRCU_HSIRCBL(BitLength));

  HT_PWRCU->HSIRCR = BitLength;
}
#endif
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
